RU/Files/day2_LabWork/cases/setFarField/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-5;

boundaryField
{
    left
    {
        type            fixedValue;
        value           uniform 1e-05;
    }

    right
    {
        type            inletOutlet;
        inletValue      uniform 1e-5;
        value           uniform 1e-5;
    }

    up
    {
        type            symmetryPlane;
    }

    down
    {
        type            symmetryPlane;
    }
    
    cylinder
    {
	type		kqRWallFunction;
	value		uniform 1e-5;
    }

    frontAndBack    
    {
        type            empty;
    }
}

// ************************************************************************* //
